Tekla Open API Reference for Tekla Structures 2025
Drawing.Delete Method
 Deletes the drawing. An active drawing cannot be deleted.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Delete()
Public Overrides Function Delete As Boolean
Return Value
Type: Boolean
True on success.
Exceptions
Exception | Condition
CannotDeleteActiveDrawingException | Thrown if the drawing is active.
See Also
Reference
Drawing Class
Tekla.Structures.Drawing Namespace